---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationBranchSize
source: html/23d3d055-7ab7-dfed-ac86-07d75666c53b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationBranchSize Property

"Size of Primary Branch End"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationBranchSize { get; }
```